//Дано число больше 9. Вывести на экран  вторую цифру числа с конца

int a= 562;
Console.WriteLine(a/10%10);
